In [ ]:
import pandas as pd
print(pd.__version__)

2.2.2

In [ ]:
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
import pandas as pd
series_1 = pd.Series([100, 200, 300, 400, 500])
print(series_1)

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [ ]:
import pandas as pd
print(series_1[1], series_1[3])

200 400

In [ ]:
import pandas as pd
series_2 = pd.Series([10, 20, 30, 40, 50])
series_sum = series_1 + series_2
print(series_sum)

0    110
1    220
2    330
3    440
4    550
dtype: int64

In [ ]:
import pandas as pd
print(df[['Name', 'City']])

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [ ]:
import pandas as pd
df['Salary'] = [50000, 60000, 70000]
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [ ]:
import pandas as pd
total_salary = df['Salary'].sum()
print("The total salary is :",total_salary)

The total salary is : 180000

In [ ]:
import pandas as pd
df_filtered_age = df[df['Age'] > 28]
print(df_filtered_age)

      Name  Age         City  Salary
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [ ]:
import pandas as pd
df_indexed = df.set_index('Name')
print(df_indexed)
df_reset = df_indexed.reset_index()
print(df_reset)

         Age         City  Salary
Name
Alice     25     New York   50000
Bob       30  Los Angeles   60000
Charlie   35      Chicago   70000
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [ ]:
import pandas as pd

employee_data = {
    'Name': ['John', 'Jane', 'Emily'],
    'Department': ['Sales', 'Marketing', 'HR'],
    'Salary': [50000, 60000, 55000]
}

df_employees = pd.DataFrame(employee_data)
df_employees.to_csv('employees.csv', index=False)
print("File created successfully.")

File created successfully.

In [ ]:
import pandas as pd
df_from_csv = pd.read_csv('employees.csv')
print(df_from_csv)

    Name Department  Salary
0   John      Sales   50000
1   Jane  Marketing   60000
2  Emily         HR   55000

In [ ]:
import pandas as pd
df_filtered_salary = df_from_csv[df_from_csv['Salary'] > 55000]
print(df_filtered_salary)

   Name Department  Salary
1  Jane  Marketing   60000

In [ ]:
import pandas as pd
avg_salary_by_dept = df_employees.groupby('Department')['Salary'].mean()
print(avg_salary_by_dept)

Department
HR           55000.0
Marketing    60000.0
Sales        50000.0
Name: Salary, dtype: float64

In [ ]:
import pandas as pd
min_salary_by_dept = df_employees.groupby('Department')['Salary'].min()
max_salary_by_dept = df_employees.groupby('Department')['Salary'].max()
print(min_salary_by_dept, max_salary_by_dept)

Department
HR           55000
Marketing    60000
Sales        50000
Name: Salary, dtype: int64 Department
HR           55000
Marketing    60000
Sales        50000
Name: Salary, dtype: int64

In [ ]:
import pandas as pd
df1 = pd.DataFrame({
    'Name': ['John', 'Jane', 'Emily'],
    'Department': ['Sales', 'Marketing', 'HR']
})
df2 = pd.DataFrame({
    'Name': ['John', 'Jane', 'Emily'],
    'Experience (Years)': [5, 7, 3]
})
df_merged = pd.merge(df1, df2, on='Name')
print(df_merged)

    Name Department  Experience (Years)
0   John      Sales                   5
1   Jane  Marketing                   7
2  Emily         HR                   3

In [ ]:
import pandas as pd
df_sorted = df_merged.sort_values(by='Experience (Years)', ascending=False)
print(df_sorted)

    Name Department  Experience (Years)
1   Jane  Marketing                   7
0   John      Sales                   5
2  Emily         HR                   3